<template>
    <section id="descrWh">
        <div class="container">
            <div class="row">
                <div class="col-lg-4">
                    <h2>Часто <br>
                    задаваемые <br>
                    вопросы</h2>
                </div>
                <div class="col-lg-8">
                    <div class="ac-item" v-for="item in program" :class="{ activeAc : item.active }">
                        <div class="ac-title" @click="item.active = !item.active">
                            <h3>{{item.title}}</h3>
                            <img src="../assets/img/plus.svg" alt="">
                        </div>
                        <div class="ac-body">
                            <p class="black-txt" v-html="item.descr"></p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
</template>


<script>

export default{
    data(){
        return{
            program: [
                {
                    title: 'Сколько длится обучение на марафоне?',
                    active: false,
                    descr: 'Весь курс можно пройти за 7 дней, если уделять обучению пару часов в день. Каждый день- новая тема. Доступ к урокам и сопроводительным материалам останется на 90 дней.'
                },
                {
                    title: 'Как проходит общение с учениками?',
                    active: false,
                    descr: 'Для удобного и привычного общения мы сделали специальный чат-бот в телеграмм, где можно пообщаться с кураторами школы и задать вопросы. В боте есть много полезных дополнительных материалов, по оборудованию и съёмке которые мы регулярно обновляем. <br><br> Также у нас есть общий чат-болталка для всех студентов школы, где можно поделиться своими результатами и получить обратную связь. Доступ в чат-болталку получают все студенты школы.'
                },
                {
                    title: 'Можно купить сейчас, а пройти потом?',
                    active: false,
                    descr: 'Можно, но мы ведь с вами знаем, что лучше начинать обучение сразу. Нужно приложить немного усилия над собой, добавить чуток дисциплины и уже первые результаты в съёмке дадут большой заряд, чтобы продолжить получить новые знания и весело проводить время.'
                },
                {
                    title: 'Сколько времени нужно уделять учёбе?',
                    active: false,
                    descr: 'Если не отвлекаться каждые пять минут, на прохождение курса достаточно уделять 45-60 минут в день. Уроки длятся от 5 до 25 минут, но самое интересное- это опробовать новые знания и попробовать снять кадры по заданию самостоятельно.'
                },
                {
                    title: 'Если я не могу смотреть уроки в определённое время?',
                    active: false,
                    descr: 'Все уроки доступны в записи. Просматривать можно в любое удобное время на телефоне, планшете или компьютере. Лекции будут публиковаться строго по расписанию, однако, посмотреть их можно в любое время сразу после публикации.'
                },
            ]
        }
    }
}
</script>


<style scoped>
/* .ac-title h3{
    font-size: 24px;
    font-weight: 600;
    color: #fff;
    max-width: 80%;
}
.ac-body .black-txt{
    color: #fff;
}
.ac-item{
    border-bottom: 1px #d1d1d129 solid;
}
*/
.ac-item:first-child {
    border-top: 1px #d1d1d129 solid;
} 
.ac-item:last-child {
    border-bottom: 1px #d1d1d129 solid;
} 
@media (max-width: 672px) {
    #descrWh{
		border-radius: 0 0 30px 30px;
	}
}
</style>