<template>
    <section id="descr">
        <div class="container">
            <div class="row">
                <div class="col-lg-12">
                    <h2 >Что тебя <br>
                    ждёт впереди</h2>
                </div>
                <div class="col-lg-3">
                    <div class="icon-box">
                        <img src="../assets/img/fi1.svg" alt="">
                        <h3>Пока что <br> ты новичок</h3>
                        <p class="grey-txt">Твоя задача взять максимум платных и бесплатных проектов, чтобы набраться опыта. Твой доход до 200$</p>      
                    </div>
                </div>
                <div class="col-lg-3">
                    <div class="icon-box">
                        <img src="../assets/img/fi2.svg" alt="">
                        <h3>Учишься на <br> своих ошибках</h3>
                        <p class="grey-txt">Здесь ты продолжаешь работу с несколькими проектами с первого месяца и берешь за небольшой чек новые. Задача сделать портфоило. Твой доход до 500$</p>      
                    </div>
                </div>
                <div class="col-lg-3">
                    <div class="icon-box">
                        <img src="../assets/img/mi2.svg" alt="">
                        <h3>Прогрессируешь <br> и развиваешься</h3>
                        <p class="grey-txt">Здесь ты уверенно берешь проекты с более высоким чеком. Ты растешь и начинает подключаться сарафанное радио. Твой доход до 1000$</p>      
                    </div>
                </div>
                <div class="col-lg-3">
                    <div class="icon-box">
                        <img src="../assets/img/fi3.svg" alt="">
                        <h3>Набираешь <br> оборот</h3>
                        <p class="grey-txt">Ты развиваешь личный бренд, оформляешь крутое портфолио, повышаешь чеки, проводишь съемки и зарабатываешь до 3000$</p>      
                    </div>
                </div>

                <div class="col-lg-8">
                    <p class="big-gr">
                        <br><br>
                        Конечно, ты можешь пытаться самостоятельно изучать тонкости и подводные камни съемки видео. А потом удивляться, почему ничего не работает. Переучиваться заново. Тратить месяцы, силы и деньги и все равно не получать результат.
                    </p>
                </div>

            </div>
        </div>
    </section>
</template>