<template>
    <section id="nikita">
        <div class="container">
            <div class="row">
                <div class="col-lg-12">
                    <h2>Преподаватель</h2>
                </div>
                <div class="col-lg-5 hidden-xs hidden-sm">
                    <div class="about-nik">
                        <img src="../assets/img/ni1.svg" alt="">
                        <h3>Бросил учебу ради съёмок в 16 лет</h3>
                    </div>
                    <div class="about-nik">
                        <img src="../assets/img/ni2.svg" alt="">
                        <h3>Потратил на собственное обучение и развитие  более 30.000$ </h3>
                    </div>
                    <div class="about-nik">
                        <img src="../assets/img/ni3.svg" alt="">
                        <h3>Снимает от 7000$ за 45 сек ролик</h3>
                    </div>
                </div>
                <div class="col-lg-3">
                    <img src="../assets/img/nikava.png" class="nik-ava">
                </div>
                <div class="col-lg-4">
                    <h4>Никита Пугачев</h4>
                    <a href="https://www.instagram.com/nikitapugachev/">
                        <p class="big-gr">
                        <svg width="30" height="29" viewBox="0 0 30 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g opacity="0.7">
                            <path d="M21.4195 0.0390625H8.46361C4.06386 0.0390625 0.484375 3.50548 0.484375 7.76605V20.3121C0.484375 24.5728 4.06386 28.0391 8.46361 28.0391H21.4195C25.8196 28.0391 29.399 24.5726 29.399 20.3121V7.76605C29.3992 3.50548 25.8196 0.0390625 21.4195 0.0390625ZM26.8338 20.3121C26.8338 23.203 24.405 25.5548 21.4196 25.5548H8.46361C5.47845 25.5549 3.04982 23.203 3.04982 20.3121V7.76605C3.04982 4.87532 5.47845 2.52336 8.46361 2.52336H21.4195C24.4048 2.52336 26.8336 4.87532 26.8336 7.76605L26.8338 20.3121Z" fill="#F2F2F2"/>
                            <path d="M14.9408 6.82471C10.8325 6.82471 7.49023 10.0612 7.49023 14.0396C7.49023 18.0178 10.8325 21.2542 14.9408 21.2542C19.0491 21.2542 22.3914 18.0178 22.3914 14.0396C22.3914 10.0612 19.0491 6.82471 14.9408 6.82471ZM14.9408 18.7697C12.2473 18.7697 10.0557 16.6478 10.0557 14.0394C10.0557 11.4309 12.2471 9.30884 14.9408 9.30884C17.6345 9.30884 19.8259 11.4309 19.8259 14.0394C19.8259 16.6478 17.6344 18.7697 14.9408 18.7697Z" fill="#F2F2F2"/>
                            <path d="M22.7036 4.71899C22.2093 4.71899 21.7238 4.91277 21.3747 5.25229C21.0239 5.59015 20.8223 6.06051 20.8223 6.54081C20.8223 7.01962 21.0241 7.48981 21.3747 7.82933C21.7236 8.16719 22.2093 8.36263 22.7036 8.36263C23.1996 8.36263 23.6836 8.16719 24.0342 7.82933C24.3848 7.48981 24.5849 7.01945 24.5849 6.54081C24.5849 6.06051 24.3848 5.59015 24.0342 5.25229C23.6853 4.91277 23.1996 4.71899 22.7036 4.71899Z" fill="#F2F2F2"/>
                            </g>
                            </svg>

                        nikitapugachev 146К</p>
                    </a>
                </div>
                <div class="col-lg-5 hidden-lg hidden-md">
                    <div class="about-nik">
                        <img src="../assets/img/ni1.svg" alt="">
                        <h3>Бросил учебу ради съёмок в 16 лет</h3>
                    </div>
                    <div class="about-nik">
                        <img src="../assets/img/ni2.svg" alt="">
                        <h3>Потратил на собственное обучение и развитие  более 30.000$ </h3>
                    </div>
                    <div class="about-nik">
                        <img src="../assets/img/ni3.svg" alt="">
                        <h3>Снимает от 7000$ за 45 сек ролик</h3>
                    </div>
                </div>
            </div>
        </div>
    </section>
</template>


<style scoped>
a .big-gr {
    cursor: pointer;
}
.big-gr svg{
    margin-bottom: -8px;
}
</style>
