<template>
    <section id="descrWh">
        <div class="container">
            <div class="row">
                <div class="col-lg-4">
                    <h2>Программа <br> курса</h2>
                    <p class="black-txt player-inf">
                        <img src="../assets/img/play.svg" alt="">24 лекций  
                        <img src="../assets/img/timer.svg" style="margin-left:5px;">7 дней
                    </p>
                </div>
                <div class="col-lg-8">
                    <div class="ac-item" v-for="(item, index) in program" :class="{ activeAc : item.active }"
                    :key="index">
                        <div class="ac-title" @click="item.active = !item.active">
                            <div>
                                <p class="black-txt">Модуль {{index + 1}}</p>
                                <h3>{{item.title}}</h3>
                            </div>
                            <img src="../assets/img/plus.svg" alt="">
                        </div>
                        <div class="ac-body">
                            <p class="black-txt" v-html="item.descr"></p>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
</template>


<script>

export default{
    data(){
        return{
            program: [
                {
                    title: 'Оборудование для мобильной съёмки',
                    active: false,
                    descr: 'На этом уроке мы разберемся в вечном вопросе сравнения телефона и фотоаппарата. Рассмотрим, как добиться качественного изображения, о чем нужно знать при покупке смартфона для своих съёмок, и стоит ли переходить на iPhone, если у тебя Android.'
                },
                {
                    title: 'Учимся ставить красивый свет',
                    active: false,
                    descr: 'Поставим схемы света для портрета и предметной съемки мелких объектов, а также научим работать с естественным освещением. Расскажем, как ставить несколько схем света, на что обращать внимание при съёмке и разберем частые ошибки.'
                },
                {
                    title: 'Видеоэффекты и лайфхаки для съёмки',
                    active: false,
                    descr: 'Научимся базовым техникам, которые помогут сделать видео интереснее: съёмки, наезды, пролеты, статичные планы. Как правильно их снять и что для этого может пригодиться. Рассмотрим частые ошибки начинающих. Научимся делать максимально качественное изображение в ваших видео.<br><br>• Работа со стандартным приложением<br>• Правильная экспозиция<br>• Свет и объем<br>• Съёмка в золотой час<br>• Плавное движение<br>• Виды панорамирования<br>• Создание эффекта параллакс<br>• Съёмка на стабилизатор<br>• Параллельное движение<br>• Съёмка ручной камерой (создание динамики)<br>• Съёмка на штатив<br>• Съёмка с нижней точки<br>• Создание кинематографичного наезда<br>• Что влияет на популярность ролика<br>• Лайфхак - съёмка от первого лица<br>• Лайфхак - делаем плавные проезды<br>• Лайфхак - съемка через отражение<br>• Спецэффект - клонирование<br>• Спецэффект - добавление текста позади человека<br>• Спецэффект - с вешалками<br>• Спецэффект - супермен<br>• Спецэффект - переход через ускорение'
                },
                {
                    title: 'Правильная композиция',
                    active: false,
                    descr: 'Научимся основным правилам по композиции. Разберем частые вопросы и базовые правила выставления кадра, а также, как хорошая композиция влияет на качество кадра. На реальных примерах рассмотрим частые ошибки.'
                },
                {
                    title: 'Смартфон или камера',
                    active: false,
                    descr: 'На этом уроке мы разберемся в вечном вопросе сравнения телефона и фотоаппарата. Рассмотрим, как добиться качественного изображения, о чем нужно знать при покупке смартфона для своих съёмок, и стоит ли переходить на iPhone, если у тебя Android. Зачем снимать дорогие ролики на телефон. Плюсы и минусы съёмки на камеру. Главные ограничения телефонов. Плюсы и минусы съёмки на телефон.  Как выбрать себе телефон.  iOS vs Android выбираем лучшее. Лучшие телефоны для качественной съёмки.'
                },
                {
                    title: 'Монтаж и публикация ролика',
                    active: false,
                    descr: 'Расскажем, как правильно копировать и хранить материал, какие наиболее безопасные и удобные способы передачи файлов без потери качества существуют. Разберемся, в каких форматах и каком разрешении лучше всего сохранять материал для YouTube и остальных социальных сетей. '
                },
                {
                    title: 'Цветокоррекция',
                    active: false,
                    descr: 'Профессиональная цветокоррекция отснятого материала в программе DaVinci Resolve 17. '
                }
            ]
        }
    }
}
</script>
